In [27]:
def import_cap():
    import pandas as pd
    import numpy as np
    return pd,np

In [28]:
pd,np = import_cap()

In [29]:
df = pd.DataFrame({'A':[1,2,3,4], 
              'B':[444,555,666,444], 
              'C':['abc','def','ghi','xyz']})
df.head(3)

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi

### Info on Unique values

In [30]:
df['B'].unique()

array([444, 555, 666], dtype=int64)

### Number of  unique values

In [31]:
df['B'].nunique()

3

In [32]:
df['B'].value_counts()

444    2
555    1
666    1
Name: B, dtype: int64

In [33]:
def times2(x):
    return x*2

In [34]:
df[['A_squared','B_squared']] = df[['A','B']].apply(times2)
df

   A    B    C  A_squared  B_squared
0  1  444  abc          2        888
1  2  555  def          4       1110
2  3  666  ghi          6       1332
3  4  444  xyz          8        888

In [35]:
df['C'].apply(len)

0    3
1    3
2    3
3    3
Name: C, dtype: int64

### Deleting a column

In [36]:
del df['A']
df

     B    C  A_squared  B_squared
0  444  abc          2        888
1  555  def          4       1110
2  666  ghi          6       1332
3  444  xyz          8        888

### Column and index names

In [37]:
df.columns

Index(['B', 'C', 'A_squared', 'B_squared'], dtype='object')

In [38]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
df.sort_values(by = 'B') #inplace=False by and asccending=True by default

     B    C  A_squared  B_squared
0  444  abc          2        888
3  444  xyz          8        888
1  555  def          4       1110
2  666  ghi          6       1332